TestCases/rotatingObjectTest2Oversets/Main/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "overset|overset2"
    {
        type            overset;
    }

    "(wall|object|inlet)"
    {
        type            fixedFluxPressure;
    }
    outlet
	{
		type			fixedValue;
		value			uniform 0;
	}
}

// ************************************************************************* //
