TestCases/rotatingObjectTest2Oversets/Main/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "0.0001/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    wall
    {
        type            wall;
        physicalType    patch;
        nFaces          101;
        startFace       1851;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          4;
        startFace       1952;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          4;
        startFace       1956;
    }
    defaultFaces
    {
        type            empty;
        nFaces          2634;
        startFace       1960;
    }
    overset
    {
        type            overset;
        physicalType    patch;
        nFaces          62;
        startFace       4594;
    }
    object
    {
        type            wall;
        physicalType    patch;
        nFaces          40;
        startFace       4656;
    }
    overset2
    {
        type            overset;
        physicalType    patch;
        nFaces          38;
        startFace       4696;
    }
)

// ************************************************************************* //
