TestCases/rotatingObjectTest2Oversets/Main/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default              Euler;
}

interpolationSchemes
{
    default              linear;
}

divSchemes
{
    default                             none;
    div(rhoPhi,U)                       Gauss linearUpwind grad(U);
    div(phi,omega)                      Gauss upwind;
    div(phi,k)                          Gauss upwind;
    div(phi,alpha)                      Gauss vanLeer;
    div(phirb,alpha)                    Gauss interfaceCompression;
    div((muEff*dev(T(grad(U)))))        Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

gradSchemes
{
    default              Gauss linear;
    grad(U)              cellLimited Gauss linear 1;
}

laplacianSchemes
{
    default              Gauss linear limited corrected 0.33;
}

snGradSchemes
{
    default              limited corrected 0.33;
}

fluxRequired
{
    default              no;
    p_rgh;
    pcorr;
    alpha.water;
}

wallDist
{
    method meshWave;
}

oversetInterpolation
{
    method         leastSquares;
}

oversetInterpolationSuppressed
{
    grad(p_rgh);
    surfaceIntegrate(phiHbyA);
}

// ************************************************************************* //
